In [19]:
import pandas as pd

movie_df = pd.read_csv("data/movies.dat", sep="::", header=0, names=["movie_id", "title", "genres"])
movie_df.head()

/var/folders/kc/9dc5fhnd0j54qt3j3j4ptc0m0000gn/T/ipykernel_8164/2900347148.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movie_df = pd.read_csv('data/movies.dat', sep='::', header=0, names=['movie_id', 'title', 'genres'])

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [27]:
genres_set = movie_df["genres"].str.split("|").explode().unique()
years_set = movie_df["title"].str.extract(r"\((\d{4})\)")[0].dropna().astype(int).unique()
len(genres_set), len(years_set), movie_df["movie_id"].nunique(), movie_df["title"].nunique()

(18, 81, 3883, 3883)

In [11]:
new_movie_df = movie_df.copy()
new_movie_df["year"] = new_movie_df["title"].str.extract(r"\((\d{4})\)")
new_movie_df["clean_title"] = new_movie_df["title"].str.replace(r"\(\d{4}\)", "", regex=True).str.strip()
new_movie_df.to_csv("processed/new_movies.csv", index=False)
new_movie_df.head()

,movie_id,title,genres,year,clean_title
0,1,Toy Story (1995),Animation|Children's|Comedy,1995,Toy Story
1,2,Jumanji (1995),Adventure|Children's|Fantasy,1995,Jumanji
2,3,Grumpier Old Men (1995),Comedy|Romance,1995,Grumpier Old Men
3,4,Waiting to Exhale (1995),Comedy|Drama,1995,Waiting to Exhale
4,5,Father of the Bride Part II (1995),Comedy,1995,Father of the Bride Part II

In [13]:
ratings_df = pd.read_csv("data/ratings.dat", sep="::", header=0, names=["user_id", "movie_id", "rating", "timestamp"])
ratings_df.to_csv("processed/new_ratings.csv", index=False)
ratings_df.head()

/var/folders/kc/9dc5fhnd0j54qt3j3j4ptc0m0000gn/T/ipykernel_8164/1484612929.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  ratings_df = pd.read_csv('data/ratings.dat', sep='::', header=0, names=['user_id', 'movie_id', 'rating', 'timestamp'])

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

对年龄使用最简单的实现
- 直接 age // 10

In [18]:
users_df = pd.read_csv(
    "data/users.dat", sep="::", header=0, names=["user_id", "sex", "age", "occupation", "zip_code"]
)  # user_id::sex::age::occupation::zip_code
# users_df.to_csv('processed/new_users.csv', index=False)
# users_df.head()
users_df["age_bucket"] = users_df["age"] // 10
users_df.to_csv("processed/new_users.csv", index=False)
users_df.head()

/var/folders/kc/9dc5fhnd0j54qt3j3j4ptc0m0000gn/T/ipykernel_8164/2047334770.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  users_df = pd.read_csv('data/users.dat', sep='::', header=0, names=['user_id', 'sex', 'age', 'occupation', 'zip_code'])    # user_id::sex::age::occupation::zip_code

   user_id sex  age  occupation zip_code  age_bucket
0        1   F    1          10    48067           0
1        2   M   56          16    70072           5
2        3   M   25          15    55117           2
3        4   M   45           7    02460           4
4        5   M   25          20    55455           2

In [ ]:
# 对 age 的分桶直接 等距分桶

age
25    2096
35    1193
18    1103
45     550
50     496
56     380
1      222
Name: count, dtype: int64